# Introduction

The RMS Titanic, a British passenger liner that set sail on its maiden voyage from Southampton to New York City in April 1912, is an iconic vessel forever remembered for its tragic fate. On the night of April 15, 1912, the Titanic struck an iceberg and sank, resulting in the loss of over 1,500 lives. This catastrophic event remains a subject of historical interest and a symbol of human hubris.

The "Titanic - Machine Learning from Disaster" dataset is one of the most well-known datasets in the field of data science and machine learning. It provides a comprehensive record of passengers on board the Titanic, including their personal information, such as name, age, gender, class, fare, cabin, and whether they survived or not. This dataset offers a unique opportunity to explore and analyze historical data to gain insights into the factors that influenced survival rates.

The dataset is frequently used in machine learning and data science competitions on Kaggle, a popular platform for data analysis and predictive modeling. The Kaggle competition associated with this dataset challenges data scientists to build predictive models to determine the likelihood of passenger survival based on various attributes. In this report, we will address the following research questions:

1. Did Passenger Class Affect Survival Rates?
2. What Role Did Gender Play in Survival?
3. How Did Age Impact Survival on the Titanic?
4. Did Family Size Influence Survival?
5. Were There Geographic Differences in Survival Rates?
6. What Insights Can We Gain from Cabin Location?

In addition to answering these questions, we will also explore machine learning techniques to predict survival and consider clustering and visualization approaches to gain a deeper understanding of the dataset.

In [1]:
# !pip install pandas-profiling
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import pandas_profiling
from scipy import stats

C:\Users\jelle\OneDrive - ROCvA, ROCvF en VOvA\projecten\Kaggle-Titanic\venv\lib\site-packages\numba\core\decorators.py:262: NumbaDeprecationWarning: numba.generated_jit is deprecated. Please see the documentation at: https://numba.readthedocs.io/en/stable/reference/deprecation.html#deprecation-of-generated-jit for more information and advice on a suitable replacement.
  warnings.warn(msg, NumbaDeprecationWarning)
C:\Users\jelle\OneDrive - ROCvA, ROCvF en VOvA\projecten\Kaggle-Titanic\venv\lib\site-packages\visions\backends\shared\nan_handling.py:51: NumbaDeprecationWarning: The 'nopython' keyword argument was not supplied to the 'numba.jit' decorator. The implicit default value for this argument is currently False, but it will be changed to True in Numba 0.59.0. See https://numba.readthedocs.io/en/stable/reference/deprecation.html#deprecation-of-object-mode-fall-back-behaviour-when-using-jit for details.
  def hasna(x: np.ndarray) -> bool:
C:\Users\jelle\AppData\Local\Temp\ipykernel_13200\1921708739.py:6: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  import pandas_profiling

In [2]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Data cleaning

In [3]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
train.drop(["Cabin"], axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [8]:
mean_age = train["Age"].mean().round(1)
train = train.fillna(mean_age)

In [9]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
 12  Age_Group    891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

making age groups to use later in some visuals.

i will use the following age groups:

**Infants and Toddlers**: Age 0-2 years old.

**Children**: Age 3-12 years old.

**Adolescents**: Age 13-18 years old.

**Young Adults**: Age 19-30 years old.

**Adults**: Age 31-60 years old.

**Seniors**: Age 61 and older.

In [10]:
train.loc[(train["Age"] >= 0.0) & (train["Age"] <= 2.0), "Age_Group"] = "Infants and Toddlers"
train.loc[(train["Age"] >= 3.0) & (train["Age"] <= 12.0), "Age_Group"] = "Children"
train.loc[(train["Age"] >= 13.0) & (train["Age"] <= 18.0), "Age_Group"] = "Adolescents"
train.loc[(train["Age"] >= 19.0) & (train["Age"] <= 30.0), "Age_Group"] = "Young Adults"
train.loc[(train["Age"] >= 31.0) & (train["Age"] <= 60.0), "Age_Group"] = "Adults"
train.loc[(train["Age"] >= 61.0), "Age_Group"] = "Seniors"

train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,29.7,S,Young Adults
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adults
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,29.7,S,Young Adults
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adults
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,29.7,S,Adults
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,29.7,S,Young Adults
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Young Adults
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.7,1,2,W./C. 6607,23.4500,29.7,S,Young Adults
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Young Adults
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,29.7,Q,Adults